Revit 2027 API
DividedPath.Create Method
Overload List
Name | Description
Create(Document, IList<Reference>) |  Creates a new instance of a divided path with a default layout.
Create(Document, IList<Reference>, ICollection<ElementId>) |  Creates a new instance of a divided path whose points are determined by the intersecting elements.
Top
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace